# Содиков Фарход, ПИ19-1, Олимпиада по программированию

In [50]:
import pandas as pd
import numpy as np
import math

### Random data

In [51]:
tb = {
    'Debtor': ['Person 01', 'Person 02', 'Person 03', 'Person 02', 'Person 03', 'Person 01'], 
    'Creditor': ['Person 02', 'Person 01', 'Person 04', 'Person 04', 'Person 04', 'Person 02'],
    'Amount of debt': [600, 300, 250, 450, 200, 60]
     }

mainData = pd.DataFrame(tb)
mainData

      Debtor   Creditor  Amount of debt
0  Person 01  Person 02             600
1  Person 02  Person 01             300
2  Person 03  Person 04             250
3  Person 02  Person 04             450
4  Person 03  Person 04             200
5  Person 01  Person 02              60

### Grouping matching data

In [52]:
mainData = mainData.groupby(['Debtor', 'Creditor']).sum().reset_index()
mainData

      Debtor   Creditor  Amount of debt
0  Person 01  Person 02             660
1  Person 02  Person 01             300
2  Person 02  Person 04             450
3  Person 03  Person 04             450

In [53]:
secondData = mainData.copy()
secondData.rename(columns = {'Debtor' : 'Creditor', 'Creditor' : 'Должник'}, inplace = True)
secondData = secondData.reindex(columns = ['Debtor','Creditor','Amount of debt'])
secondData['Amount of debt'] = -mainData['Amount of debt']
secondData

   Debtor   Creditor  Amount of debt
0     NaN  Person 01            -660
1     NaN  Person 02            -300
2     NaN  Person 02            -450
3     NaN  Person 03            -450

### Joining two tables

In [54]:
results = pd.concat([mainData , secondData]).groupby(['Debtor', 'Creditor']).sum().reset_index()
results.drop(results[results['Amount of debt'] < 0].index, inplace = True)
results

      Debtor   Creditor  Amount of debt
0  Person 01  Person 02             660
1  Person 02  Person 01             300
2  Person 02  Person 04             450
3  Person 03  Person 04             450